-- УСО Э. ПЛК А1
-- конфигурация опрашиваемых дискретных входов
-- 	["1"] - номер слота модуля в корзине
--   i1="i1" - номер задействованного канала модуля
--

 -- карта задействованных дискретных входов, убрав номер из таблицы можно исключить вход из обработки-- зависит от таблицы подключений!!!!!!!!!!
local RawDI= {
			["4"]={"i1", "i2", "i3", "i4", "i5", "i6", "i7", "i8", "i9",},
			["5"]={"i1", "i2", "i3", "i4", "i5", "i6", "i7", "i8", "i9", "i10", "i11", "i12", "i13", "i14", "i15", "i16", },
			["6"]={"i1", "i2", "i3", "i4", "i5", "i6", "i7", "i8", "i9", "i10", "i11", "i12", "i13", "i14", "i15", "i16" ,},
			["7"]={"i1", "i2", "i3", "i4", "i5", "i6", "i7", "i8", "i9", "i10", "i11", "i12", "i13", "i14", "i15", "i16" ,},
			["8"]={"i1", "i2", "i3", "i4", "i5", "i6", "i7",  "i14", "i15", "i16" ,},
			["9"]={"i1", "i2", "i3", "i4", "i5", "i6", "i7", "i8", "i9", "i10", "i11" ,},
			["10"]={},
	      }
return RawDI;